// src/components/Skills/Skills.js
import React from "react";
import { CSSTransition } from "react-transition-group";
import "./Skills.css";

function Skills() {
  return (
    <CSSTransition in={true} appear={true} timeout={500} classNames="fade">
      <div className="skills-container">
        <h1 className="skills-title">My skills Front-End Basic</h1>
        <div className="big-number">3</div>
        <div className="vertical-line"></div>
        <p>
          Ласкаво просимо на мою сторінку портфоліо! Я маю досвід та навички у
          розробці Front-End веб-сайтів і додатків. Нижче перелічені мої основні
          навички та здібності:
        </p>
        <h2>Верстка та макетування</h2>
        <ul>
          <li>
            Блочна верстка: Вмію створювати структуру веб-сторінок,
            використовуючи елементи &lt;div&gt; для створення блоків контенту.
          </li>
          <li>
            Позиціонування елементів: Розумію різні методи позиціонування, такі
            як Absolute, Fixed, Relative та Static, і використовую їх для
            досягнення потрібного розміщення елементів на сторінці.
          </li>
          <li>
            Обтікання елементів: Вмію використовувати властивість float для
            обтікання елементів та створення колонок на сторінці.
          </li>
          <li>
            Робота з Flexbox і Grid: Володію навичками роботи з гнучкими і
            сітковими системами, що дозволяють ефективно розташовувати елементи
            на сторінці.
          </li>
        </ul>
        <h2>Стилізація</h2>
        <ul>
          <li>
            Псевдокласи і псевдоелементи: Використовую псевдокласи та
            псевдоелементи для стилізації елементів сторінки.
          </li>
          <li>
            Робота зі списками: Вмію створювати нумеровані і марковані списки зі
            стилізацією.
          </li>
          <li>
            Таблиці: Стилізую таблиці та роблю їх вигляд більш привабливим та
            інформативним.
          </li>
          <li>
            Інпути та форми: Розумію роботу з інпутами та формами і стилізую їх,
            щоб вони були користувачів.
          </li>
        </ul>
        <h2>Технології</h2>
        <ul>
          <li>
            HTML5 та CSS3: Володію стандартами HTML5 і CSS3 та оновлюю їхні
            знання з оглядом останніх змін.
          </li>
          <li>
            Pixel Perfect верстка: Досягаю високої точності в верстці,
            дотримуючись заданих макетів.
          </li>
          <li>
            Регулярні вирази (RegExp): Використовую регулярні вирази для обробки
            текстових даних та валідації введених даних.
          </li>
          <li>
            Responsive верстка: Розроблюю адаптивні сторінки, що підлаштовуються
            під різні розміри екранів.
          </li>
          <li>
            Chrome DevTools: Використовую інструменти розробника Chrome для
            відлагодження та аналізу мобільної верстки.
          </li>
          <li>
            Підходи до верстки: Застосовую підходи mobile-first і desktop-first,
            враховуючи потреби різних пристроїв.
          </li>
          <li>
            Браузерна сумісність: Впевнений в кросбраузерній сумісності та
            вирішенні проблем, які можуть виникнути на різних браузерах.
          </li>
        </ul>
        <h2>Інструменти і фреймворки</h2>
        <ul>
          <li>
            Бібліотеки і фреймворки: Розумію використання різних бібліотек та
            фреймворків, зокрема MaterialUI та Bootstrap.
          </li>
          <li>
            Twitter Bootstrap: Маю досвід використання Twitter Bootstrap для
            швидкої та ефективної розробки сторінок.
          </li>
          <li>
            Анімація в CSS3: Створюю анімації за допомогою CSS3 для поліпшення
            користувацького досвіду.
          </li>
          <li>
            Препроцесори: Використовую препроцесори, такі як Pug (Jade), Less та
            SASS, для зручності написання HTML та CSS коду.
          </li>
          <li>
            БЕМ (Блок, Елемент, Модифікатор): Застосовую методологію БЕМ для
            структуризації та надання структури CSS класам.
          </li>
        </ul>
        <h2>Інструменти для оптимізації</h2>
        <ul>
          <li>
            Валідація: Валідую HTML та CSS код за допомогою Google Pages та W3C
            для забезпечення стандартів якості.
          </li>
          <li>
            TinyPNG: Використовую інструмент TinyPNG для стиснення зображень і
            підвищення швидкості завантаження сторінок.
          </li>
          <li>
            Спрайти: Використовую спрайти для оптимізації завантаження зображень
            та зменшення кількості HTTP-запитів.
          </li>
          <li>
            Кросбраузерність та робота з retina: Впевнено роблю сторінки
            кросбраузерними і забезпечую підтримку retina-екранів.
          </li>
          <li>
            canIUse: Використовую canIUse для перевірки підтримки браузерами
            різних властивостей та функцій.
          </li>
        </ul>
        <h2>Інструменти для тестування</h2>
        <ul>
          <li>
            BrowserStack: Використовую BrowserStack для тестування та перевірки
            веб-сайтів на різних пристроях і браузерах.
          </li>
          <li>
            Модульна сітка: Використовую модульну сітку для структуризації
            верстки та покращення масштабованості.
          </li>
        </ul>
        <h1 className="skills-title">My skills Front-End Advanced</h1>
        <p>
          Розширені знання HTML5 та CSS3. Високий рівень експертизи в роботі з
          JavaScript. Оптимізація веб-сайтів для швидкості та продуктивності.
          Робота з адаптивним дизайном та мобільною розробкою. Використання
          сучасних фреймворків та бібліотек для розробки веб-додатків.
        </p>
        <h2>JavaScript</h2>
        <ul>
          <li>Знання ES6+ стандарту.</li>
          <li>
            Високий рівень розуміння асинхронного програмування та обіцянок
            (Promises).
          </li>
          <li>Робота з API та взаємодія з сервером.</li>
          <li>Створення інтерактивних веб-додатків та веб-сайтів.</li>
        </ul>
        <h2>React</h2>
        <ul>
          <li>Глибоке розуміння React та React компонентів.</li>
          <li>
            Розробка односторінкових додатків (SPA) з використанням React
            Router.
          </li>
          <li>Управління станом додатків за допомогою React Redux.</li>
          <li>Використання контексту та хуків для кращого керування станом.</li>
        </ul>
        <h2>Redux</h2>
        <ul>
          <li>Створення і налаштування Redux store.</li>
          <li>Використання диспетчерів та дій для керування станом додатка.</li>
          <li>Розуміння концепцій імутабельності та редукторів.</li>
        </ul>
        <h2>TypeScript</h2>
        <ul>
          <li>
            Використання TypeScript для створення типізованих веб-додатків.
          </li>
          <li>Робота з інтерфейсами та типами даних.</li>
          <li>
            Підтримка автоматичної перевірки типів та інтеграція TypeScript у
            проект.
          </li>
        </ul>
        <h2>Інші технології</h2>
        <ul>
          <li>
            Використання Git для версіонування коду та спільної роботи в
            команді.
          </li>
          <li>Знання основ серверного розробництва та API взаємодії.</li>
          <li>
            Робота зі збірниками (Webpack, Parcel) та менеджерами пакетів (npm,
            yarn).
          </li>
          <li>
            Оптимізація та тестування веб-додатків для забезпечення надійності
            та швидкості.
          </li>
        </ul>
        <p>
          Я завжди вдосконалюю свої навички та вивчаю нові технології, щоб
          забезпечити найкращий результат у роботі над проектами.
        </p>
      </div>
    </CSSTransition>
  );
}

export default Skills;
