import React from "react";
import { CSSTransition } from "react-transition-group";
import "./Jobs.css";

function Jobs() {
  return (
    <CSSTransition in={true} appear={true} timeout={500} classNames="fade">
      <div className="jobs-container">
        <h1 className="jobs-title">Мy jobs</h1>
        <div className="big-number">4</div>
        <div className="vertical-line"></div>
        <div className="job">
          <h2>Frontend developer</h2>
          <p>
            <strong>Компанія:</strong> ABC Technologies Inc.
          </p>
          <p>
            <strong>Тривалість роботи:</strong> Січень 2020 - донині
          </p>
          <h3>Обов'язки та відповідальності:</h3>
          <ul className="job-ul">
            <li>Розробка та підтримка веб-додатків</li>
            <li>
              Розробка високоякісних веб-додатків для наших клієнтів, що включає
              створення інтерактивних та естетичних інтерфейсів.
            </li>
            <li>
              Забезпечення оптимальної продуктивності та сумісності веб-додатків
              на різних веб-переглядачах.
            </li>
            <li>Взаємодія з дизайнерами та бекенд-розробниками</li>
            <li>
              Співпраця з дизайнерами для забезпечення відповідності дизайну та
              покращення користувацького досвіду.
            </li>
            <li>
              Активна комунікація та інтеграція фронтенду з серверною частиною
              додатків, спільно з бекенд-розробниками.
            </li>
            <li>Використання сучасних технологій та інструментів</li>
            <li>
              Постійне оновлення навичок та використання передових технологій,
              таких як React, Angular, та Vue.js, для побудови інноваційних
              веб-інтерфейсів.
            </li>
            <li>
              Застосування системи контролю версій Git для ефективного керування
              кодом та спільної роботи з командою.
            </li>
            <li>Тестування та оптимізація швидкості завантаження</li>
            <li>
              Високий рівень уваги до тестування, виявлення та усунення помилок,
              що допомагає забезпечити стабільну роботу додатків.
            </li>
            <li>
              Оптимізація ресурсів для скорочення часу завантаження додатків та
              підвищення їх продуктивності.
            </li>
          </ul>
          <h3>Досягнення:</h3>
          <ul className="job-ul">
            <li>Впровадження реактивного інтерфейсу</li>
            <li>
              Ключова роль у створенні реактивного інтерфейсу для важливого
              клієнта.
            </li>
            <li>
              Збільшення користувацької активності на 30% та покращення враження
              користувачів.
            </li>
            <li>Підвищення продуктивності сайту</li>
            <li>
              Оптимізація, що знизила час завантаження головного сайту на 20%.
            </li>
            <li>
              Покращення користувацького досвіду та позицій у пошукових
              системах.
            </li>
            <li>Мобільна сумісність</li>
            <li>
              Активна участь у проекті з підвищення мобільної сумісності
              додатків.
            </li>
            <li>Збільшення трафіку з мобільних пристроїв на 25%.</li>
          </ul>
        </div>
        {/*інші роботи за аналогією */}
      </div>
    </CSSTransition>
  );
}

export default Jobs;
